import { characterResult } from "./CharacterAPI";

export const CHARACTERS_MOCK: characterResult = {
        "characters": [
            {
                "character_id": 3,
                "name": "Дрэгонбэйт",
                "race": "Сауриал",
                "class_field": "Паладин",
                "description": "Дрэгонбэйт является чемпионом добра из расы сауриал, которая возникла на далёком мире, и представители которого имеют долгую жизнь. В Забытых Королевствах проживает очень мало сауриалов, и, как полагают, не существует никаких сельских сообществ в любой точке мира. Дрэгонбэйт ростом 4 фута 10 дюймов, весит 150 фунтов и имеет сухую морщинистую шкуру. Он владеет длинным мечом «Святой мститель» и носит сине-красно-белый щит. Хотя у него есть общие особенности с паладинами, Дрэгонбэйт не является членом какого-либо класса. Используя способность, известную как Шен-стейт, он может определить мировоззрение любого существа в пределах 60 футов от него.",
                "features": "Божественное здоровье, Аура сопротивления магии",
                "hit_points": 120,
                "armor_class": 18,
                "photo_url": "http://localhost:9000/dungeonsanddragonsphotos/DragonBait.png"
            },
            {
                "character_id": 7,
                "name": "Александр",
                "race": "Кувшин",
                "class_field": "Воин",
                "description": "Александр был создан как сосуд, живой кувшин для останков погибших воинов. Они переходят из кувшина в кувшин в надежде обрести величие. Так в Александре живёт множество славных воителей, якобы королевских воинов, мечтающих стать великими героями. Это его предназначение, цель его поисков и бремя — вечно совершенствоваться и испытывать себя в битвах с сильнейшими врагами. И когда-нибудь он с воинами станет одним целым. Величайшим героем всех времён.",
                "features": "1500 рун, осколок воина кувшина",
                "hit_points": 100,
                "armor_class": 10,
                "photo_url": "http://localhost:9000/dungeonsanddragonsphotos/7.png"
            },
            {
                "character_id": 1,
                "name": "Боско Даггерхэнд",
                "race": "Человек",
                "class_field": "Следопыт",
                "description": "Боско Даггерхэнд зовётся так, потому что он никогда не пожимает руку, если его другая рука не лежит угрожающе на рукояти кинжал в ножнах. Он держит полудикого дейнониха в качестве сторожевого животного, которым он управляет своим волшебным кольцом. Пираты кличут хищника Костяшкой, потому что у того, кто достаточно глуп, чтобы дать ему укусить руку, больше ничего не останется.",
                "features": "Кольцо влияния на животных, тактика стаи",
                "hit_points": 32,
                "armor_class": 11,
                "photo_url": "http://localhost:9000/dungeonsanddragonsphotos/1.png"
            },
            {
                "character_id": 6,
                "name": "Тиамат",
                "race": "Исчадие",
                "class_field": "Божество",
                "description": "Тиамат зла и жестока. Она ненавидит светлых богов. Тиамат также ненавидит металлических драконов. Возможно она ненавидит и самоцветных. Кроме того она очень хитра. Чаще всего она принимает облик пятиглавой драконицы, каждая голова которой имеет цвет одного из видов злых драконов (красный, синий, зеленый, белый, черный). Также она часто предстает в облике соблазнительницы, настолько прекрасной, что ни один мужчина не может устоять перед ней. Еще одна излюбленная ее форма – Темная Воительница. Кроме того Такхизис очень хитра. Однажды Гит обратилась к Такхизис за помощью - свергнуть иллитидов и освободить гитиянки. Тазихис предоставила им помощь, но после победы выяснилось, что Гит должна уйти к ней в услужение",
                "features": "Иммунитет почти ко всему виду урона и состоянию",
                "hit_points": 615,
                "armor_class": 25,
                "photo_url": "http://localhost:9000/dungeonsanddragonsphotos/Tiamat.png"
            },
            {
                "character_id": 2,
                "name": "Бастиан Термандар",
                "race": "Огненный дженази",
                "class_field": "Заклинатель",
                "description": "Подобно многим в культе огня, Бастиан горит внутренним огнём, но его пламя питает скорее честолюбие, а не желание увидеть выжженный дочиста мир. Бастиан замышляет свергнуть Вейнифер и присвоить Высекающий Искры себе. Бастиан практикует тайные искусства, причем многое о своей магии огня он узнал от самой Вейнифер. В бою он полагается на свои заклинания: его прозвали «быстрый ожог», так как обычно он пытается нанести максимальный урон в начале схватки. Если Бастиан знает, что грядёт бой, но не может нанести упреждающий удар, он становится более осторожным, вызывая стену огня, чтобы защитить себя, прежде чем использовать другие боевые заклинания.",
                "features": "Заклинатель 9 уровня.",
                "hit_points": 75,
                "armor_class": 15,
                "photo_url": "http://localhost:9000/dungeonsanddragonsphotos/BastianTarmandr.png"
            },
        ],
        "CharacterOnMapID": "",
        "CharacterOnMapCount": 0
}